[{"brand":"Apple","model":"iPhone 15","colour":"Midnight Blue","storage":"128","price":"1399.99","description":"Introducing the iPhone 15 in stunning Midnight Blue. With its sleek design and powerful features, this smartphone is your ultimate companion. Enjoy an immersive viewing experience on the 6.1-inch Super Retina XDR display. Equipped with the A17 Bionic chip, it delivers blazing-fast performance for all your apps and games. Capture every moment with the advanced dual-camera system, featuring a 48MP main sensor and a 12MP ultra-wide lens. Plus, with all-day battery life and 128GB of storage, you'll have plenty of room for your photos, videos, and apps. Experience the future of mobile technology with the iPhone 15.","image":"https://hniesfp.imgix.net/8/images/detailed/660/MU7A3ZDA.jpg?fit=fill&bg=0FFF&w=833&h=555&auto=format,compress"},{"brand":"Apple","model":"iPhone 14 Pro","colour":"Graphite","storage":"512","price":"1599.99","description":"Unleash your creativity with the iPhone 14 Pro in elegant Graphite. Featuring a stunning 6.1-inch ProMotion display, this smartphone delivers smooth scrolling and fluid graphics for an unparalleled viewing experience. Powered by the A16 Bionic chip, it offers lightning-fast performance and efficiency for all your tasks. Capture stunning photos and videos with the advanced triple-camera system, which includes a 64MP main sensor, a 12MP ultra-wide lens, and a 12MP telephoto lens. With 512GB of storage, you'll have ample space for your media library and apps. Plus, with all-day battery life and iOS 16, you can stay productive and connected wherever you go. Elevate your mobile experience with the iPhone 14 Pro.","image":"https://mintplus.ie/cdn/shop/products/AppleiPhone12Pro-Graphitev1_600x.jpg?v=1643891304"},{"brand":"Apple","model":"iPhone 13 Mini","colour":"Pink","storage":"256","price":"999.99","description":"Experience the power of Apple in a compact design with the iPhone 13 Mini in vibrant Pink. With its 5.4-inch Super Retina XDR display, this smartphone fits comfortably in your hand while delivering stunning visuals. Powered by the A15 Bionic chip, it offers blazing-fast performance and efficiency for all your daily tasks. Capture every moment with the advanced dual-camera system, featuring a 12MP main sensor and a 12MP ultra-wide lens. With 256GB of storage, you'll have plenty of space for your photos, videos, and apps. Plus, with all-day battery life and iOS 15, you can stay connected and productive throughout the day. Get ready to explore the possibilities with the iPhone 13 Mini.","image":"https://store.storeimages.cdn-apple.com/4668/as-images.apple.com/is/iphone-13-mini-pink-select-2021?wid=940&hei=1112&fmt=jpeg&qlt=80&.v=1631748594000"},{"brand":"Apple","model":"iPhone 12 Pro Max","colour":"Pacific Blue","storage":"256","price":"1299.99","description":"Take your mobile experience to the next level with the iPhone 12 Pro Max in striking Pacific Blue. Featuring a massive 6.7-inch Super Retina XDR display, this smartphone delivers immersive visuals with true-to-life colors. Powered by the A14 Bionic chip, it offers blazing-fast performance for all your apps and games. Capture stunning photos and videos with the advanced triple-camera system, which includes a 12MP main sensor, a 12MP ultra-wide lens, and a 12MP telephoto lens. With 256GB of storage, you'll have ample space for your media library and apps. Plus, with all-day battery life and iOS 14, you can stay productive and connected wherever you go. Elevate your mobile experience with the iPhone 12 Pro Max.","image":"https://store.storeimages.cdn-apple.com/4668/as-images.apple.com/is/iphone-12-pro-family-hero?wid=470&hei=556&fmt=jpeg&qlt=95&op_usm=0.5,0.5&.v=1601075933000"},{"brand":"Apple","model":"iPhone SE (2nd generation)","colour":"Product(RED)","storage":"64","price":"399.99","description":"Experience the power of Apple in a compact and affordable package with the iPhone SE (2nd generation) in vibrant Product(RED). Featuring a 4.7-inch Retina HD display, this smartphone delivers crisp visuals and easy one-handed use. Powered by the A13 Bionic chip, it offers fast performance for everyday tasks. Capture stunning photos and videos with the 12MP rear camera, which supports Portrait mode and 4K video recording. With 64GB of storage, you'll have plenty of space for your apps, games, and photos. Plus, with Touch ID and iOS 13, you can enjoy secure authentication and the latest features from Apple. Get ready to experience the best of both worlds with the iPhone SE (2nd generation).","image":"https://store.storeimages.cdn-apple.com/4668/as-images.apple.com/is/iphone-se-red-select-2020_GEO_EMEA?wid=940&hei=1112&fmt=jpeg&qlt=80&.v=1586574264000"},{"brand":"Apple","model":"iPhone 11","colour":"Yellow","storage":"128","price":"599.99","description":"Get ready to upgrade your mobile experience with the iPhone 11 in vibrant Yellow. Featuring a 6.1-inch Liquid Retina display, this smartphone delivers stunning visuals with true-to-life colors. Powered by the A13 Bionic chip, it offers blazing-fast performance for all your apps and games. Capture amazing photos and videos with the dual-camera system, which includes a 12MP wide and ultra-wide lens. With 128GB of storage, you'll have ample space for your media library and apps. Plus, with all-day battery life and iOS 13, you can stay productive and connected throughout the day. Experience the power of Apple with the iPhone 11.","image":"https://store.storeimages.cdn-apple.com/4668/as-images.apple.com/is/iphone11-yellow-select-2019?wid=940&hei=1112&fmt=jpeg&qlt=80&.v=1566960958082"},{"brand":"Apple","model":"iPhone XS","colour":"Space Gray","storage":"256","price":"899.99","description":"Experience the pinnacle of Apple design and performance with the iPhone XS in sleek Space Gray. Featuring a stunning 5.8-inch Super Retina display, this smartphone delivers immersive visuals with true-to-life colors. Powered by the A12 Bionic chip, it offers blazing-fast performance and efficiency for all your apps and games. Capture stunning photos and videos with the advanced dual-camera system, which includes a 12MP wide and telephoto lens. With 256GB of storage, you'll have ample space for your media library and apps. Plus, with all-day battery life and iOS 12, you can stay productive and connected throughout the day. Elevate your mobile experience with the iPhone XS.","image":"https://mintplus.ie/cdn/shop/files/Apple_iPhone_XS_-_Space_Grey_1a5ba89d-0734-47cd-8c5c-4697952a0ae5_600x.jpg?v=1693477927"},{"brand":"Apple","model":"iPhone X","colour":"Silver","storage":"64","price":"699.99","description":"Enter the future of mobile technology with the iPhone X in sleek Silver. Featuring a stunning 5.8-inch Super Retina display, this smartphone delivers immersive visuals with true-to-life colors. Powered by the A11 Bionic chip, it offers blazing-fast performance and efficiency for all your apps and games. Capture stunning photos and videos with the advanced dual-camera system, which includes a 12MP wide and telephoto lens. With 64GB of storage, you'll have ample space for your media library and apps. Plus, with all-day battery life and iOS 11, you can stay productive and connected throughout the day. Elevate your mobile experience with the iPhone X.","image":"https://store.storeimages.cdn-apple.com/4668/as-images.apple.com/is/iphone-x-silver-select-2017?wid=470&hei=556&fmt=jpeg&qlt=95&op_usm=0.5,0.5&.v=1550795416939"},{"brand":"Apple","model":"iPhone 8 Plus","colour":"Gold","storage":"256","price":"599.99","description":"Get ready to experience the best of Apple design and performance with the iPhone 8 Plus in luxurious Gold. Featuring a stunning 5.5-inch Retina HD display, this smartphone delivers crisp visuals and easy one-handed use. Powered by the A11 Bionic chip, it offers fast performance for everyday tasks. Capture stunning photos and videos with the advanced dual-camera system, which includes a 12MP wide and telephoto lens. With 256GB of storage, you'll have ample space for your media library and apps. Plus, with Touch ID and iOS 11, you can enjoy secure authentication and the latest features from Apple. Elevate your mobile experience with the iPhone 8 Plus.","image":"https://www.apple.com/newsroom/images/product/iphone/standard/all-new-glass-iPhone8Plus-and-iPhone8_full.jpg.og.jpg"},{"brand":"Apple","model":"iPhone SE (1st generation)","colour":"Rose Gold","storage":"32","price":"349.99","description":"Experience the power of Apple in a compact and affordable package with the iPhone SE (1st generation) in elegant Rose Gold. Featuring a 4-inch Retina display, this smartphone delivers crisp visuals and easy one-handed use. Powered by the A9 chip, it offers fast performance for everyday tasks. Capture stunning photos and videos with the 12MP rear camera, which supports 4K video recording. With 32GB of storage, you'll have plenty of space for your apps, games, and photos. Plus, with Touch ID and iOS 9, you can enjoy secure authentication and the latest features from Apple. Get ready to experience the best of both worlds with the iPhone SE (1st generation).","image":"https://www.smartcellular.ie/media/catalog/product/cache/cfaa1692031f009488d1cfea5ce7e1ee/r/g/rg5_1_1_1_1_1_1.jpg"},{"brand":"Samsung","model":"Galaxy S21 Ultra","colour":"Phantom Black","storage":"512","price":"1399.99","description":"Experience the pinnacle of Samsung innovation with the Galaxy S21 Ultra in stunning Phantom Black. Featuring a massive 6.8-inch Dynamic AMOLED 2X display with a 120Hz refresh rate, this smartphone delivers breathtaking visuals and smooth scrolling for an immersive viewing experience. Powered by the Exynos 2100 or Snapdragon 888 chipset (depending on the region), it offers lightning-fast performance and efficiency for all your apps and games. Capture stunning photos and videos with the advanced quad-camera system, which includes a 108MP wide, 12MP ultra-wide, 10MP telephoto, and 10MP periscope lens. With 512GB of storage, you'll have ample space for your media library and apps. Plus, with all-day battery life and One UI 3.1, you can stay productive and connected throughout the day. Elevate your mobile experience with the Galaxy S21 Ultra.","image":"https://images.stockx.com/images/Samsung-Galaxy-S21-Ultra-5G-12GB-RAM-128GB-Unlocked-SM-G998UZKAXAA-Phantom-Black.jpg?fit=fill&bg=FFFFFF&w=480&h=320&fm=webp&auto=compress&dpr=2&trim=color&updated_at=1611246311&q=60"},{"brand":"Samsung","model":"Galaxy Z Fold 3","colour":"Phantom Green","storage":"256","price":"1799.99","description":"Step into the future of smartphones with the Samsung Galaxy Z Fold 3 in captivating Phantom Green. This revolutionary device features a foldable 7.6-inch Dynamic AMOLED 2X display that unfolds to reveal a tablet-like experience, allowing you to multitask with ease. Powered by the Snapdragon 888 chipset, it offers blazing-fast performance and efficiency for all your productivity and entertainment needs. Capture stunning photos and videos with the versatile triple-camera system, which includes a 12MP wide, 12MP ultra-wide, and 12MP telephoto lens. With 256GB of storage, you'll have ample space for your apps, games, and multimedia content. Plus, with all-day battery life and S Pen support, you can stay productive on the go. Experience the future of mobile technology with the Galaxy Z Fold 3.","image":"https://hniesfp.imgix.net/8/images/detailed/281/01_Q2_Front-Unfolded_Green_2000x2000_Image2.jpg?fit=fill&bg=0FFF&w=833&h=555&auto=format,compress"},{"brand":"Samsung","model":"Galaxy Note 20 Ultra","colour":"Mystic Bronze","storage":"256","price":"1299.99","description":"Unleash your creativity and productivity with the Samsung Galaxy Note 20 Ultra in elegant Mystic Bronze. Featuring a stunning 6.9-inch Dynamic AMOLED 2X display with a 120Hz refresh rate, this smartphone delivers vibrant visuals and smooth scrolling for an immersive experience. Powered by the Exynos 990 or Snapdragon 865+ chipset (depending on the region), it offers powerful performance and efficiency for all your tasks. Capture pro-grade photos and videos with the advanced triple-camera system, which includes a 108MP wide, 12MP periscope telephoto, and 12MP ultra-wide lens. With 256GB of storage, you'll have ample space for your files, apps, and media. Plus, with the iconic S Pen and Samsung DeX support, you can work smarter and multitask like never before. Elevate your mobile experience with the Galaxy Note 20 Ultra.","image":"https://files.refurbed.com/pi/samsung-glxy-note-20-ultra-1600679143.jpg"},{"brand":"Samsung","model":"Galaxy S20 FE","colour":"Cloud Navy","storage":"128","price":"699.99","description":"Get ready to experience the best of Samsung with the Galaxy S20 FE in stylish Cloud Navy. Featuring a stunning 6.5-inch Super AMOLED display with a 120Hz refresh rate, this smartphone delivers vibrant visuals and smooth scrolling for an immersive viewing experience. Powered by the Snapdragon 865 chipset, it offers powerful performance and efficiency for all your daily tasks. Capture stunning photos and videos with the versatile triple-camera system, which includes a 12MP wide, 8MP telephoto, and 12MP ultra-wide lens. With 128GB of storage, you'll have plenty of space for your apps, photos, and videos. Plus, with all-day battery life and One UI 2.5, you can stay connected and productive throughout the day. Elevate your mobile experience with the Galaxy S20 FE.","image":"https://idflmobile.com/wp-content/uploads/2024/02/s20fe-cloud-navy.jpg"},{"brand":"Samsung","model":"Galaxy A52 5G","colour":"Awesome Black","storage":"128","price":"499.99","description":"Experience next-level performance and connectivity with the Samsung Galaxy A52 5G in sleek Awesome Black. Featuring a vibrant 6.5-inch Super AMOLED display with a 120Hz refresh rate, this smartphone delivers stunning visuals and smooth scrolling for an immersive experience. Powered by the Snapdragon 750G chipset, it offers fast and efficient performance for all your apps and games. Capture every moment with the versatile quad-camera system, which includes a 64MP main, 12MP ultra-wide, 5MP macro, and 5MP depth sensor. With 128GB of storage, you'll have plenty of space for your photos, videos, and apps. Plus, with 5G connectivity and all-day battery life, you can stay connected and productive wherever you go. Elevate your mobile experience with the Galaxy A52 5G.","image":"https://images.samsung.com/is/image/samsung/ie/galaxy-a52/gallery/ie-galaxy-a52-5g-enterprise-edition-sm-a526bzkdeea-frontblack-403431233?$720_576_JPG$"},{"brand":"Samsung","model":"Galaxy M51","colour":"Electric Blue","storage":"128","price":"349.99","description":"Get ready to power through your day with the Samsung Galaxy M51 in vibrant Electric Blue. Featuring a massive 6.7-inch Super AMOLED Plus display, this smartphone delivers stunning visuals with vibrant colors and crisp details. Powered by the Snapdragon 730G chipset, it offers smooth performance for all your daily tasks and entertainment. Capture stunning photos and videos with the versatile quad-camera system, which includes a 64MP main, 12MP ultra-wide, 5MP macro, and 5MP depth sensor. With 128GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a massive 7000mAh battery and fast charging support, you can stay connected and productive all day long. Elevate your mobile experience with the Galaxy M51.","image":"https://emistore.store/wp-content/uploads/2023/04/71NlQHKIb3L._SL1500_-1-1.jpg"},{"brand":"Samsung","model":"Galaxy A32","colour":"Awesome Violet","storage":"128","price":"279.99","description":"Experience affordable innovation with the Samsung Galaxy A32 in captivating Awesome Violet. Featuring a vibrant 6.4-inch Super AMOLED display, this smartphone delivers stunning visuals with vibrant colors and crisp details. Powered by the MediaTek Helio G80 chipset, it offers smooth performance for all your daily tasks and entertainment. Capture every moment with the versatile quad-camera system, which includes a 64MP main, 8MP ultra-wide, 5MP macro, and 5MP depth sensor. With 128GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Galaxy A32.","image":"https://www.phonesonline.ie/cdn/shop/products/samsung-galaxy-a32-5g-violet_1024x1024.jpg?v=1618150702"},{"brand":"Samsung","model":"Galaxy S10 Lite","colour":"Prism Black","storage":"128","price":"549.99","description":"Experience flagship features at an affordable price with the Samsung Galaxy S10 Lite in sleek Prism Black. Featuring a stunning 6.7-inch Super AMOLED Plus display, this smartphone delivers vibrant visuals with rich colors and deep blacks. Powered by the Snapdragon 855 chipset, it offers smooth performance for all your apps and games. Capture stunning photos and videos with the versatile triple-camera system, which includes a 48MP main, 12MP ultra-wide, and 5MP macro lens. With 128GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Galaxy S10 Lite.","image":"https://m.media-amazon.com/images/I/51R9L5wE2nL.jpg"},{"brand":"Samsung","model":"Galaxy A02s","colour":"Black","storage":"32","price":"149.99","description":"Get more for less with the Samsung Galaxy A02s in classic Black. Featuring a vibrant 6.5-inch PLS IPS display, this smartphone delivers immersive visuals for all your entertainment needs. Powered by the Snapdragon 450 chipset, it offers smooth performance for everyday tasks and multitasking. Capture every moment with the triple-camera system, which includes a 13MP main, 2MP macro, and 2MP depth sensor. With 32GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Galaxy A02s.","image":"https://d2e6ccujb3mkqf.cloudfront.net/68f654b9-ad86-4332-a8ec-0a8d23b7faff-1_0a6af2db-0444-4823-9cca-f69a407928d7.jpg"},{"brand":"Samsung","model":"Galaxy M31","colour":"Ocean Blue","storage":"64","price":"279.99","description":"Power through your day with the Samsung Galaxy M31 in vibrant Ocean Blue. Featuring a massive 6.4-inch Super AMOLED display, this smartphone delivers stunning visuals with vibrant colors and crisp details. Powered by the Exynos 9611 chipset, it offers smooth performance for all your daily tasks and entertainment. Capture every moment with the versatile quad-camera system, which includes a 64MP main, 8MP ultra-wide, 5MP macro, and 5MP depth sensor. With 64GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting 6000mAh battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Galaxy M31.","image":"https://m.media-amazon.com/images/I/71SujJPzttL.jpg"},{"brand":"Google","model":"Pixel 6","colour":"Sorta Seafoam","storage":"128","price":"699.99","description":"Experience the future of mobile technology with the Google Pixel 6 in Sorta Seafoam. Featuring a stunning 6.4-inch OLED display with a smooth 120Hz refresh rate, this smartphone delivers vibrant visuals and seamless interactions. Powered by the Google Tensor chipset, it offers unparalleled performance for all your apps, games, and multitasking needs. Capture every moment in stunning detail with the advanced dual-camera system, which includes a 50MP main and 12MP ultra-wide lens. With 128GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Pixel 6.","image":"https://www.buyitdirect.ie/Images/GA02910-GB_4_Supersize.jpg?v=3"},{"brand":"Google","model":"Pixel 5a","colour":"Sorta Sage","storage":"128","price":"449.99","description":"Get the best of Google with the Pixel 5a in Sorta Sage. Featuring a vibrant 6.34-inch OLED display, this smartphone delivers stunning visuals with vibrant colors and crisp details. Powered by the Qualcomm Snapdragon 765G chipset, it offers smooth performance for all your daily tasks and entertainment. Capture every moment with the advanced dual-camera system, which includes a 12.2MP main and 16MP ultra-wide lens. With 128GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Pixel 5a.","image":"https://multimedia.bbycastatic.ca/multimedia/products/500x500/177/17700/17700977.jpeg"},{"brand":"Google","model":"Pixel 4a","colour":"Just Black","storage":"128","price":"349.99","description":"Experience the power of Google in a compact design with the Pixel 4a in Just Black. Featuring a vibrant 5.81-inch OLED display, this smartphone delivers stunning visuals with vibrant colors and crisp details. Powered by the Qualcomm Snapdragon 730G chipset, it offers smooth performance for all your daily tasks and entertainment. Capture stunning photos and videos with the advanced 12.2MP rear camera. With 128GB of storage, you'll have ample space for your apps, photos, and videos. Plus, with a long-lasting battery and fast charging support, you can stay connected and productive throughout the day. Elevate your mobile experience with the Pixel 4a.","image":"https://flipphones.co.za/cdn/shop/products/04_2bc00777-1c41-4f3c-bf85-55e0faba1340_1445x.jpg?v=1636728317"},{"brand":"OnePlus","model":"OnePlus 9 Pro","colour":"Morning Mist","storage":"256GB","price":"$969.00","description":"Elevate your mobile photography with the OnePlus 9 Pro in Morning Mist. This flagship smartphone features a stunning 6.7-inch Fluid AMOLED display with a smooth 120Hz refresh rate, delivering immersive visuals with vibrant colors and deep blacks. Powered by the Qualcomm Snapdragon 888 chipset and equipped with 12GB of RAM, it offers lightning-fast performance for all your apps, games, and multitasking needs. Capture every moment with the Hasselblad quad-camera system, which includes a 48MP main, 50MP ultra-wide, 8MP telephoto, and 2MP monochrome sensor. With 256GB of storage, you'll have ample space for your photos, videos, and files. Plus, with Warp Charge 65T and a large 4,500mAh battery, you can stay powered up all day long.","image":"https://cdn.revendo.com/media/61/56/b5/1676045219/oneplus-9-pro-5g-morning-mist-guenstig-gebraucht-kaufen-2.jpg.jpg"},{"brand":"Xiaomi","model":"Mi 11 Ultra","colour":"Ceramic White","storage":"512GB","price":"$1,199.99","description":"Experience the ultimate flagship experience with the Xiaomi Mi 11 Ultra in Ceramic White. This powerhouse smartphone boasts a large 6.81-inch AMOLED display with a silky-smooth 120Hz refresh rate, delivering stunning visuals with vibrant colors and deep blacks. Powered by the Qualcomm Snapdragon 888 chipset and equipped with a whopping 12GB of RAM, it offers unparalleled performance for gaming, productivity, and more. Capture every detail with the pro-grade triple-camera system, featuring a 50MP main, 48MP ultra-wide, and 48MP telephoto lens. With a massive 5,000mAh battery and support for 67W wired and wireless charging, you can stay powered up all day and night.","image":"https://i.ebayimg.com/images/g/HqgAAOSwVF1g4XZ-/s-l1200.jpg"},{"brand":"Sony","model":"Xperia 1 III","colour":"Frosted Black","storage":"256GB","price":"$1,299.99","description":"Immerse yourself in entertainment like never before with the Sony Xperia 1 III in Frosted Black. This premium smartphone features a stunning 6.5-inch 4K HDR OLED display with a 120Hz refresh rate, delivering breathtaking visuals with unparalleled clarity and color accuracy. Powered by the Qualcomm Snapdragon 888 chipset and equipped with 12GB of RAM, it offers blazing-fast performance for all your gaming, streaming, and multitasking needs. Capture every moment with the pro-grade triple-camera system, which includes a 12MP main, 12MP ultra-wide, and 12MP telephoto lens with 3x optical zoom. With 256GB of storage, you'll have plenty of space for your photos, videos, and apps. Plus, with a large 4,500mAh battery and support for fast charging, you can stay powered up on the go.","image":"https://hniesfp.imgix.net/8/images/detailed/602/Mobile_Sony_XQDQ54C0B.EUK.jpg?fit=fill&bg=0FFF&w=1500&h=1000&auto=format,compress"},{"brand":"Asus","model":"ROG Phone 5","colour":"Phantom Black","storage":"512GB","price":"$999.99","description":"Dominate the competition with the Asus ROG Phone 5 in Phantom Black. Designed for gamers, this cutting-edge smartphone features a lightning-fast 6.78-inch AMOLED display with a 144Hz refresh rate, delivering smooth visuals and ultra-responsive touch controls for an unparalleled gaming experience. Powered by the Qualcomm Snapdragon 888 chipset and equipped with up to 16GB of RAM, it offers blistering performance for even the most demanding games and tasks. Stay cool under pressure with the innovative GameCool 5 cooling system, which keeps temperatures in check during intense gaming sessions. With a massive 6,000mAh battery and support for 65W fast charging, you can game for hours on end without worrying about running out of power.","image":"https://s3-apw.badencloud.store/49882-cdn/31224c2b-61a4-4642-83dc-7a7c32e7577d_7_1687882356.jpg"},{"brand":"Nokia","model":"8.3 5G","colour":"Polar Night","storage":"128GB","price":"$599.00","description":"Experience the future of connectivity with the Nokia 8.3 5G in Polar Night. This sleek and stylish smartphone combines cutting-edge technology with timeless design, making it the perfect companion for work and play. Featuring a large 6.81-inch PureDisplay with HDR support, it delivers stunning visuals with vibrant colors and sharp details. Powered by the Qualcomm Snapdragon 765G chipset and equipped with 8GB of RAM, it offers smooth performance for multitasking, gaming, and streaming. Capture every moment with the versatile quad-camera system, which includes a 64MP main, 12MP ultra-wide, 2MP macro, and 2MP depth sensor. With 128GB of storage, you'll have plenty of space for your photos, videos, and apps. Plus, with 5G connectivity, you can enjoy lightning-fast download and streaming speeds wherever you go.","image":"https://community.three.ie/t5/image/serverpage/image-id/9371i714716C44F2442B5/image-size/medium?v=v2&px=400"},{"brand":"Motorola","model":"Edge 20 Pro","colour":"Midnight Blue","storage":"256GB","price":"$799.99","description":"Elevate your mobile experience with the Motorola Edge 20 Pro in Midnight Blue. This premium smartphone combines sleek design with powerful performance, making it the perfect companion for work and play. Featuring a stunning 6.7-inch OLED display with a silky-smooth 144Hz refresh rate, it delivers immersive visuals with vibrant colors and deep blacks. Powered by the Qualcomm Snapdragon 870 chipset and equipped with 8GB of RAM, it offers lightning-fast performance for multitasking, gaming, and streaming. Capture every moment with the advanced triple-camera system, which includes a 108MP main, 16MP ultra-wide, and 8MP telephoto lens with 5x optical zoom. With 256GB of storage, you'll have plenty of space for your photos, videos, and apps. Plus, with a large 4,500mAh battery and support for fast charging, you can stay powered up all day long.","image":"https://motorolauk.vtexassets.com/arquivos/ids/158529/motorola-edge-20-pro-pdp-render-8-Baltic-blue-gq89b9ir.png?v=637630747033670000"},{"brand":"LG","model":"Velvet","colour":"Aurora White","storage":"128GB","price":"$699.00","description":"Experience style and performance with the LG Velvet in Aurora White. This sleek and stylish smartphone features a stunning 6.8-inch OLED display with a cinematic 20.5:9 aspect ratio, delivering immersive visuals with vibrant colors and deep blacks. Powered by the Qualcomm Snapdragon 765G chipset and equipped with 6GB of RAM, it offers smooth performance for all your daily tasks and entertainment. Capture stunning photos and videos with the versatile triple-camera system, which includes a 48MP main, 8MP ultra-wide, and 5MP depth sensor. With 128GB of storage, you'll have plenty of space for your photos, videos, and apps. ","image":"https://i.ebayimg.com/images/g/brYAAOSwy8BfBclz/s-l600.jpg"},{"brand":"Apple","model":"Iphone 15 Pro Max","colour":"Black","storage":"128","price":"1489.99","description":"h","image":"https://store.storeimages.cdn-apple.com/4668/as-images.apple.com/is/iphone-15-pro-finish-select-202309-6-7inch-blacktitanium?wid=5120&hei=2880&fmt=p-jpg&qlt=80&.v=1692845694698"}]